<script setup lang="ts">

</script>

<template>
    <svg id="_Ð¡Ð»Ð¾Ð¹_1" data-name="Ð¡Ð»Ð¾Ð¹ 1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" viewBox="0 0 79.59 55.61">
        <defs>
            <linearGradient id="_Ð‘ÐµÐ·Ñ‹Ð¼ÑÐ½Ð½Ñ‹Ð¹_Ð³Ñ€Ð°Ð´Ð¸ÐµÐ½Ñ‚_42" data-name="Ð‘ÐµÐ·Ñ‹Ð¼ÑÐ½Ð½Ñ‹Ð¹ Ð³Ñ€Ð°Ð´Ð¸ÐµÐ½Ñ‚ 42" x1="32.25" y1="15.84" x2="51.89" y2="15.84" gradientUnits="userSpaceOnUse">
                <stop offset="0" stop-color="#0e33fe"/>
                <stop offset="1" stop-color="#86f9b8"/>
            </linearGradient>
            <linearGradient id="_Ð‘ÐµÐ·Ñ‹Ð¼ÑÐ½Ð½Ñ‹Ð¹_Ð³Ñ€Ð°Ð´Ð¸ÐµÐ½Ñ‚_42-2" data-name="Ð‘ÐµÐ·Ñ‹Ð¼ÑÐ½Ð½Ñ‹Ð¹ Ð³Ñ€Ð°Ð´Ð¸ÐµÐ½Ñ‚ 42" x1="-14.51" y1="-16.33" x2=".05" y2="-16.33" gradientTransform="translate(58.4 11.08) rotate(-180)" xlink:href="#_Ð‘ÐµÐ·Ñ‹Ð¼ÑÐ½Ð½Ñ‹Ð¹_Ð³Ñ€Ð°Ð´Ð¸ÐµÐ½Ñ‚_42"/>
            <linearGradient id="_Ð‘ÐµÐ·Ñ‹Ð¼ÑÐ½Ð½Ñ‹Ð¹_Ð³Ñ€Ð°Ð´Ð¸ÐµÐ½Ñ‚_42-3" data-name="Ð‘ÐµÐ·Ñ‹Ð¼ÑÐ½Ð½Ñ‹Ð¹ Ð³Ñ€Ð°Ð´Ð¸ÐµÐ½Ñ‚ 42" x1="-18.54" y1="-30.11" x2="-3.98" y2="-30.11" gradientTransform="translate(58.4 11.08) rotate(-180)" xlink:href="#_Ð‘ÐµÐ·Ñ‹Ð¼ÑÐ½Ð½Ñ‹Ð¹_Ð³Ñ€Ð°Ð´Ð¸ÐµÐ½Ñ‚_42"/>
            <linearGradient id="_Ð‘ÐµÐ·Ñ‹Ð¼ÑÐ½Ð½Ñ‹Ð¹_Ð³Ñ€Ð°Ð´Ð¸ÐµÐ½Ñ‚_42-4" data-name="Ð‘ÐµÐ·Ñ‹Ð¼ÑÐ½Ð½Ñ‹Ð¹ Ð³Ñ€Ð°Ð´Ð¸ÐµÐ½Ñ‚ 42" x1="-44.38" y1="-5.17" x2="-29.83" y2="-5.17" gradientTransform="translate(19.28 39.96) rotate(-173.88)" xlink:href="#_Ð‘ÐµÐ·Ñ‹Ð¼ÑÐ½Ð½Ñ‹Ð¹_Ð³Ñ€Ð°Ð´Ð¸ÐµÐ½Ñ‚_42"/>
            <linearGradient id="_Ð‘ÐµÐ·Ñ‹Ð¼ÑÐ½Ð½Ñ‹Ð¹_Ð³Ñ€Ð°Ð´Ð¸ÐµÐ½Ñ‚_42-5" data-name="Ð‘ÐµÐ·Ñ‹Ð¼ÑÐ½Ð½Ñ‹Ð¹ Ð³Ñ€Ð°Ð´Ð¸ÐµÐ½Ñ‚ 42" x1="22.18" y1="37.45" x2="47.31" y2="37.45" xlink:href="#_Ð‘ÐµÐ·Ñ‹Ð¼ÑÐ½Ð½Ñ‹Ð¹_Ð³Ñ€Ð°Ð´Ð¸ÐµÐ½Ñ‚_42"/>
            <linearGradient id="_Ð‘ÐµÐ·Ñ‹Ð¼ÑÐ½Ð½Ñ‹Ð¹_Ð³Ñ€Ð°Ð´Ð¸ÐµÐ½Ñ‚_42-6" data-name="Ð‘ÐµÐ·Ñ‹Ð¼ÑÐ½Ð½Ñ‹Ð¹ Ð³Ñ€Ð°Ð´Ð¸ÐµÐ½Ñ‚ 42" x1="1" y1="22.87" x2="27.05" y2="22.87" xlink:href="#_Ð‘ÐµÐ·Ñ‹Ð¼ÑÐ½Ð½Ñ‹Ð¹_Ð³Ñ€Ð°Ð´Ð¸ÐµÐ½Ñ‚_42"/>
        </defs>
        <g>
            <path class="cls-2" d="M38.56,1.85l-6.31,13.66,16.32,14.31c2.56-5.9,3.86-12.83,3.1-20.46V1.85h-13.11Z"/>
            <path class="cls-1" d="M38.56,1.85l-6.31,13.66,16.32,14.31c2.56-5.9,3.86-12.83,3.1-20.46V1.85h-13.11Z"/>
        </g>
        <g>
            <polygon class="cls-6" points="62.54 22.87 58.35 31.95 72.9 31.95 62.54 22.87"/>
            <polygon class="cls-1" points="62.54 22.87 58.35 31.95 72.9 31.95 62.54 22.87"/>
        </g>
        <g>
            <polygon class="cls-5" points="66.58 36.65 62.38 45.74 76.94 45.74 66.58 36.65"/>
            <polygon class="cls-1" points="66.58 36.65 62.38 45.74 76.94 45.74 66.58 36.65"/>
        </g>
        <g>
            <polygon class="cls-4" points="53.05 44.2 47.91 52.79 62.38 54.34 53.05 44.2"/>
            <polygon class="cls-1" points="53.05 44.2 47.91 52.79 62.38 54.34 53.05 44.2"/>
        </g>
        <g>
            <path class="cls-7" d="M32.28,25.96l-10.1,21.85c1.81.63,3.64,1.02,5.43,1.1,6.61.28,13.97-3.38,19.7-9.77l-15.03-13.18Z"/>
            <path class="cls-1" d="M32.28,25.96l-10.1,21.85c1.81.63,3.64,1.02,5.43,1.1,6.61.28,13.97-3.38,19.7-9.77l-15.03-13.18Z"/>
        </g>
        <g>
            <path class="cls-3" d="M16.26,44.73l10.79-23.35L3.8,1H1.31v7.52c-1.95,16.27,5.55,29.73,14.95,36.22Z"/>
            <path class="cls-1" d="M16.26,44.73l10.79-23.35L3.8,1H1.31v7.52c-1.95,16.27,5.55,29.73,14.95,36.22Z"/>
        </g>
    </svg>
</template>

<style scoped lang="css">
.cls-1 {
    fill: none;
    stroke: #52a4d6;
    stroke-miterlimit: 10;
    stroke-width: 2px;
}
    
    .cls-2 {
        fill: url(#_Ð‘ÐµÐ·Ñ‹Ð¼ÑÐ½Ð½Ñ‹Ð¹_Ð³Ñ€Ð°Ð´Ð¸ÐµÐ½Ñ‚_42);
}
    
    .cls-2, .cls-3, .cls-4, .cls-5, .cls-6, .cls-7 {
        stroke-width: 0px;
}
    
    .cls-3 {
        fill: url(#_Ð‘ÐµÐ·Ñ‹Ð¼ÑÐ½Ð½Ñ‹Ð¹_Ð³Ñ€Ð°Ð´Ð¸ÐµÐ½Ñ‚_42-6);
}
    
    .cls-4 {
        fill: url(#_Ð‘ÐµÐ·Ñ‹Ð¼ÑÐ½Ð½Ñ‹Ð¹_Ð³Ñ€Ð°Ð´Ð¸ÐµÐ½Ñ‚_42-4);
}
    
    .cls-5 {
        fill: url(#_Ð‘ÐµÐ·Ñ‹Ð¼ÑÐ½Ð½Ñ‹Ð¹_Ð³Ñ€Ð°Ð´Ð¸ÐµÐ½Ñ‚_42-3);
}
    
    .cls-6 {
        fill: url(#_Ð‘ÐµÐ·Ñ‹Ð¼ÑÐ½Ð½Ñ‹Ð¹_Ð³Ñ€Ð°Ð´Ð¸ÐµÐ½Ñ‚_42-2);
}
    
    .cls-7 {
        fill: url(#_Ð‘ÐµÐ·Ñ‹Ð¼ÑÐ½Ð½Ñ‹Ð¹_Ð³Ñ€Ð°Ð´Ð¸ÐµÐ½Ñ‚_42-5);
}
</style>