<script setup lang="ts">

</script>

<template>
    <svg id="_Ð¡Ð»Ð¾Ð¹_1" data-name="Ð¡Ð»Ð¾Ð¹ 1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" viewBox="0 0 70.04 60.09">
        <defs>
            <linearGradient id="_Ð‘ÐµÐ·Ñ‹Ð¼ÑÐ½Ð½Ñ‹Ð¹_Ð³Ñ€Ð°Ð´Ð¸ÐµÐ½Ñ‚_42" data-name="Ð‘ÐµÐ·Ñ‹Ð¼ÑÐ½Ð½Ñ‹Ð¹ Ð³Ñ€Ð°Ð´Ð¸ÐµÐ½Ñ‚ 42" x1="45.24" y1="17.95" x2="69.04" y2="17.95" gradientUnits="userSpaceOnUse">
                <stop offset="0" stop-color="#0e33fe"/>
                <stop offset="1" stop-color="#86f9b8"/>
            </linearGradient>
            <linearGradient id="_Ð‘ÐµÐ·Ñ‹Ð¼ÑÐ½Ð½Ñ‹Ð¹_Ð³Ñ€Ð°Ð´Ð¸ÐµÐ½Ñ‚_42-2" data-name="Ð‘ÐµÐ·Ñ‹Ð¼ÑÐ½Ð½Ñ‹Ð¹ Ð³Ñ€Ð°Ð´Ð¸ÐµÐ½Ñ‚ 42" x1="26.35" y1="6.5" x2="44" y2="6.5" xlink:href="#_Ð‘ÐµÐ·Ñ‹Ð¼ÑÐ½Ð½Ñ‹Ð¹_Ð³Ñ€Ð°Ð´Ð¸ÐµÐ½Ñ‚_42"/>
            <linearGradient id="_Ð‘ÐµÐ·Ñ‹Ð¼ÑÐ½Ð½Ñ‹Ð¹_Ð³Ñ€Ð°Ð´Ð¸ÐµÐ½Ñ‚_42-3" data-name="Ð‘ÐµÐ·Ñ‹Ð¼ÑÐ½Ð½Ñ‹Ð¹ Ð³Ñ€Ð°Ð´Ð¸ÐµÐ½Ñ‚ 42" x1="26.67" y1="45.17" x2="57.13" y2="45.17" xlink:href="#_Ð‘ÐµÐ·Ñ‹Ð¼ÑÐ½Ð½Ñ‹Ð¹_Ð³Ñ€Ð°Ð´Ð¸ÐµÐ½Ñ‚_42"/>
            <linearGradient id="_Ð‘ÐµÐ·Ñ‹Ð¼ÑÐ½Ð½Ñ‹Ð¹_Ð³Ñ€Ð°Ð´Ð¸ÐµÐ½Ñ‚_42-4" data-name="Ð‘ÐµÐ·Ñ‹Ð¼ÑÐ½Ð½Ñ‹Ð¹ Ð³Ñ€Ð°Ð´Ð¸ÐµÐ½Ñ‚ 42" x1="1" y1="27.5" x2="32.58" y2="27.5" xlink:href="#_Ð‘ÐµÐ·Ñ‹Ð¼ÑÐ½Ð½Ñ‹Ð¹_Ð³Ñ€Ð°Ð´Ð¸ÐµÐ½Ñ‚_42"/>
        </defs>
        <g>
            <path class="cls-2" d="M52.89,1l-7.65,16.56,19.78,17.34c3.11-7.15,4.68-15.55,3.75-24.79V1h-15.89Z"/>
            <path class="cls-1" d="M52.89,1l-7.65,16.56,19.78,17.34c3.11-7.15,4.68-15.55,3.75-24.79V1h-15.89Z"/>
        </g>
        <g>
            <polygon class="cls-5" points="38.91 12.01 44 1 26.35 1 38.91 12.01"/>
            <polygon class="cls-1" points="38.91 12.01 44 1 26.35 1 38.91 12.01"/>
        </g>
        <g>
            <path class="cls-4" d="M38.91,31.26l-12.24,26.48c2.2.77,4.41,1.24,6.58,1.33,8.01.34,16.93-4.1,23.87-11.84l-18.22-15.97Z"/>
            <path class="cls-1" d="M38.91,31.26l-12.24,26.48c2.2.77,4.41,1.24,6.58,1.33,8.01.34,16.93-4.1,23.87-11.84l-18.22-15.97Z"/>
        </g>
        <g>
            <path class="cls-3" d="M19.5,54l13.08-28.3L4.4,1H1.38v9.11C-.98,29.83,8.1,46.14,19.5,54Z"/>
            <path class="cls-1" d="M19.5,54l13.08-28.3L4.4,1H1.38v9.11C-.98,29.83,8.1,46.14,19.5,54Z"/>
        </g>
    </svg>
</template>

<style scoped lang="css">
.cls-1 {
    fill: none;
    stroke: #52a4d6;
    stroke-miterlimit: 10;
    stroke-width: 2px;
}
    
    .cls-2 {
        fill: url(#_Ð‘ÐµÐ·Ñ‹Ð¼ÑÐ½Ð½Ñ‹Ð¹_Ð³Ñ€Ð°Ð´Ð¸ÐµÐ½Ñ‚_42);
}
    
    .cls-2, .cls-3, .cls-4, .cls-5 {
        stroke-width: 0px;
}
    
    .cls-3 {
        fill: url(#_Ð‘ÐµÐ·Ñ‹Ð¼ÑÐ½Ð½Ñ‹Ð¹_Ð³Ñ€Ð°Ð´Ð¸ÐµÐ½Ñ‚_42-4);
}
    
    .cls-4 {
        fill: url(#_Ð‘ÐµÐ·Ñ‹Ð¼ÑÐ½Ð½Ñ‹Ð¹_Ð³Ñ€Ð°Ð´Ð¸ÐµÐ½Ñ‚_42-3);
}
    
    .cls-5 {
        fill: url(#_Ð‘ÐµÐ·Ñ‹Ð¼ÑÐ½Ð½Ñ‹Ð¹_Ð³Ñ€Ð°Ð´Ð¸ÐµÐ½Ñ‚_42-2);
}
</style>